<a href="https://colab.research.google.com/github/stacykeago/Moringa--week-5-project/blob/main/SQL_Analysis_of_Brainy_Badgers_Financial_Inclusion.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.0 Project overview

## 1.01 FINANCIAL INCLUSIVITY CHECKER

This is the notebook that will house the dataset to be prepared and later analysed in accordance to the project goals.

The group Brainy Badgers, has been tasked with assessing the level of financial inclusion in the region encompassing Kenya, Rwanda , Uganda and Tanzania. This is being done with the help of a dataset called the Financial Inclusion dataset.It is an excel format datatable that has thirteen columns and twenty three thousand five hundred and twenty five rows.The attributes are as follows:
-country 

-year 

-unique id 

-location type 

-cellphone acces 

-household size 

-Age of respondent 

-gender of respondent 

-relationship with head 

-maritial status 

-education level 

-job type

Prior to the analysis of the dataset, cleaning will be undertaken. Primarily this will involve the removal of (_) and the changing of the lettercasing to an uppercasing.

The next step will be the creation of new columns from the breaking of existing columns. From the relationship with head column,we will create a new column called HEAD OF HOUSEHOLD,this will state yes if the respondent is the head of the household.

The next column to be broken will be the maritial status column creating a new column called the LIVING CONDITION which will identify the state of the respondent whether they live with someone or alone.

To then ensure the validity of the data we will then identify duplications in the dataset ,removing all duplicates from the data.

After these processes the data will be clean to a satisfactory degree and will now be ready for analysis which will be done both in the pandas method and the sql method

## 1.02 Analysis objectives



This analysis is in the form of answering the objectives:

1.To determine the number of people with access to bank accounts and how this varies in urban and rural areas, between the job type

2.To determine the country with the most mobile phones and the highest number of bank accounts.

3.To determine the people to be targeted with mobile banking intergration

4.To determine the job type to be targeted with fintech marketing in the region for people with a phone but no bank account.

5.To determine the influence of mobile phone access and location to job type

6.To determine which age has the most access to mobile phones.

7.Age with mobile phone but no bank account.

8.Determine which age has the highest access to mobile phones and bank accounts.

9.To determine the percentage of level of access to mobile phones for people in the region per country

10.To determine the percentage of level of access to mobile phones for people in the region

11.To determine the percentage of level of access to mobile phones for people in urban areas and rural areas.

# Loading our Database

In [ ]:
# We will first load the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed. 
%sql sqlite://

'Connected: @None'

# 1.0 Import the libraries

In [ ]:
# Importing the pandas library
# We will use a function read_csv from pandas to read our datasets as shown
#
import pandas as pd

# Upload the table from the csv.

In [ ]:
# Loading our table from the respective CSV files
# We will export the dataset that we have cleaned using python
#
with open('Financial_Inclusivity.csv','r') as f:
    Financial = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Financial;
%sql PERSIST Financial;
%sql SELECT * FROM Financial LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 'Kenya', 2018, 'Yes', 'Rural', 'Yes', 3, 24, 'Female', 'Spouse', 'Married', 'Secondary education', 'Self employed', 'Living together', 'No'),
 (1, 'Kenya', 2018, 'No', 'Rural', 'No', 5, 70, 'Female', 'Head of Household', 'Widowed', 'No formal education', 'Government Dependent', 'Widowed', 'Yes'),
 (2, 'Kenya', 2018, 'Yes', 'Urban', 'Yes', 5, 26, 'Male', 'Other relative', 'Single', 'Vocational/Specialised training', 'Self employed', 'Never Married', 'No'),
 (3, 'Kenya', 2018, 'No', 'Rural', 'Yes', 5, 34, 'Female', 'Head of Household', 'Married', 'Primary education', 'Formally employed Private', 'Living together', 'Yes'),
 (4, 'Kenya', 2018, 'No', 'Urban', 'No', 8, 26, 'Male', 'Child', 'Single', 'Primary education', 'Informally employed', 'Never Married', 'No')]

#SQL Analysis

## 1.To determine the number of people with access to bank accounts and how this varies in urban and rural areas, between the job type

In [ ]:
# To determine the number of people with access to bank accounts and how this varies in urban and rural areas
%%sql
select count(bank_account), location_type
from Financial
where bank_account = 'Yes'
group by location_type

 * sqlite://
Done.

[(1671, 'Rural'), (1641, 'Urban')]

In [ ]:
# To determine the number of people with access to bank accounts and how this varies with job type
%%sql
select count(bank_account), job_type
from Financial
where bank_account = 'Yes'
group by job_type
order by count(bank_account) desc

 * sqlite://
Done.

[(848, 'Self employed'),
 (635, 'Farming and Fishing'),
 (571, 'Formally employed Private'),
 (445, 'Informally employed'),
 (300, 'Formally employed Government'),
 (240, 'Remittance Dependent'),
 (196, 'Other Income'),
 (50, 'Government Dependent'),
 (14, 'Dont Know/Refuse to answer'),
 (13, 'No Income')]

## 2.To determine the country with the most mobile phones and the highest number of bank accounts.

In [ ]:
# 2.01 To determine the country with the most bank accounts
%%sql
select country, count(bank_account)
from Financial
where bank_account = 'Yes'
group by country
order by count(bank_account) desc 
limit(1)

 * sqlite://
Done.

[('Kenya', 1521)]

In [ ]:
# 2.02 To determine the country with the most mobile phones.
%%sql
select country, count(cellphone_access)
from Financial
where cellphone_access = 'Yes'
group by country
order by count(cellphone_access) desc
limit(1)

 * sqlite://
Done.

[('Rwanda', 7249)]

## 3.To determine the people to be targeted with mobile banking intergration

In [ ]:
%%sql
select count(bank_account), count(cellphone_access), job_type
from Financial
where bank_account = 'Yes' and cellphone_access = 'Yes'
group by job_type
order by count(bank_account) desc

 * sqlite://
Done.

[(831, 831, 'Self employed'),
 (605, 605, 'Farming and Fishing'),
 (568, 568, 'Formally employed Private'),
 (435, 435, 'Informally employed'),
 (296, 296, 'Formally employed Government'),
 (227, 227, 'Remittance Dependent'),
 (186, 186, 'Other Income'),
 (35, 35, 'Government Dependent'),
 (14, 14, 'Dont Know/Refuse to answer'),
 (11, 11, 'No Income')]

## 4.To determine the job type to be targeted with fintech marketing in the region for people with a phone but no bank account

In [ ]:
%%sql
select count(bank_account), count(cellphone_access), job_type
from Financial
where bank_account = 'No' and cellphone_access = 'Yes'
group by job_type
order by count(bank_account) desc

 * sqlite://
Done.

[(3918, 3918, 'Farming and Fishing'),
 (3688, 3688, 'Self employed'),
 (3681, 3681, 'Informally employed'),
 (1383, 1383, 'Remittance Dependent'),
 (601, 601, 'Other Income'),
 (440, 440, 'Formally employed Private'),
 (282, 282, 'No Income'),
 (87, 87, 'Government Dependent'),
 (85, 85, 'Formally employed Government'),
 (81, 81, 'Dont Know/Refuse to answer')]

## 5.To determine the influence of mobile phone access and location to job type

In [ ]:
%%sql
select job_type, location_type,cellphone_access, count(cellphone_access)
from Financial
group by job_type

 * sqlite://
Done.

[('Dont Know/Refuse to answer', 'Rural', 'No', 126),
 ('Farming and Fishing', 'Rural', 'Yes', 5441),
 ('Formally employed Government', 'Rural', 'Yes', 387),
 ('Formally employed Private', 'Urban', 'Yes', 1055),
 ('Government Dependent', 'Urban', 'No', 247),
 ('Informally employed', 'Urban', 'Yes', 5597),
 ('No Income', 'Rural', 'Yes', 627),
 ('Other Income', 'Rural', 'Yes', 1080),
 ('Remittance Dependent', 'Urban', 'No', 2527),
 ('Self employed', 'Urban', 'Yes', 6437)]

## 6.To determine which age has the most access to mobile phones

In [ ]:
%%sql
select age_of_respondent, count(cellphone_access)
from Financial
where cellphone_access = 'Yes'
group by age_of_respondent
order by count(cellphone_access) desc
limit 1

 * sqlite://
Done.

[(30, 824)]

## 7.Age with mobile phone but no bank account

In [ ]:
%%sql
select age_of_respondent, count(cellphone_access)
from Financial
where cellphone_access = 'Yes' and bank_account = 'No'
group by age_of_respondent
order by count(cellphone_access) desc
limit 1

 * sqlite://
Done.

[(30, 648)]

## 8.Determine which age has the highest access to mobile phones and bank accounts.

In [ ]:
%%sql
select age_of_respondent, count(cellphone_access)
from Financial
where cellphone_access = 'Yes' and bank_account = 'Yes'
group by age_of_respondent
order by count(cellphone_access) desc
limit 1

 * sqlite://
Done.

[(30, 176)]

## 9.To determine the percentage of level of access to mobile phones for people in the region per country

In [ ]:
%%sql
select country,count(cellphone_access), (100*count(cellphone_access)/(select count(cellphone_access) from Financial where cellphone_access = 'Yes')) as percentage_country
from Financial
where cellphone_access = 'Yes' 
group by country
order by count(cellphone_access) desc

 * sqlite://
Done.

[('Rwanda', 7249, 41),
 ('Kenya', 4785, 27),
 ('Tanzania', 3956, 22),
 ('Uganda', 1464, 8)]

## 10.To determine the percentage of level of access to mobile phones for people in the region.

In [ ]:
%%sql
select (select count(cellphone_access) from Financial where cellphone_access = 'Yes')
 as Regional_cell_count, (select count(cellphone_access) from Financial) as Region_total,
(100*(select count(cellphone_access) 
from Financial where cellphone_access = 'Yes')/ (select count(cellphone_access) from Financial))
 as percentage_region

 * sqlite://
Done.

[(17454, 23524, 74)]

## 11.To determine the percentage of level of access to mobile phones for people in urban areas and rural areas

In [ ]:
%%sql
select location_type, count(cellphone_access), (select count(cellphone_access)
 from Financial where cellphone_access = 'Yes') as cell_total,
(100 * count(cellphone_access)/ (select count(cellphone_access) 
from Financial where cellphone_access = 'Yes')) as percentage_of_cell
from Financial
where cellphone_access = 'Yes'
group by location_type

 * sqlite://
Done.

[('Rural', 11070, 17454, 63), ('Urban', 6384, 17454, 36)]